bluestore/onejob-3disks/rw-4k.out
ceph-fuse-replicated: (g=0): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
ceph-fuse-erasure_1: (g=1): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
ceph-kern-replicated: (g=2): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
ceph-kern-erasure_1: (g=3): rw=rw, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
fio-2.16
Starting 4 processes

ceph-fuse-replicated: (groupid=0, jobs=1): err= 0: pid=10457: Thu Mar  1 17:08:09 2018
  read : io=28860KB, bw=492519B/s, iops=120, runt= 60003msec
    slat (msec): min=1, max=73, avg= 2.91, stdev= 2.77
    clat (msec): min=9, max=491, avg=130.09, stdev=39.21
     lat (msec): min=10, max=493, avg=133.00, stdev=39.91
    clat percentiles (msec):
     |  1.00th=[   73],  5.00th=[   80], 10.00th=[   85], 20.00th=[   93],
     | 30.00th=[  103], 40.00th=[  121], 50.00th=[  137], 60.00th=[  145],
     | 70.00th=[  151], 80.00th=[  157], 90.00th=[  165], 95.00th=[  174],
     | 99.00th=[  241], 99.50th=[  363], 99.90th=[  486], 99.95th=[  486],
     | 99.99th=[  490]
    bw (KB  /s): min=   31, max=  565, per=65.90%, avg=316.31, stdev=88.32
  write: io=28524KB, bw=486785B/s, iops=118, runt= 60003msec
    slat (msec): min=3, max=388, avg= 5.42, stdev= 7.09
    clat (usec): min=20, max=491410, avg=128776.22, stdev=40755.29
     lat (msec): min=9, max=495, avg=134.20, stdev=41.76
    clat percentiles (msec):
     |  1.00th=[   73],  5.00th=[   80], 10.00th=[   84], 20.00th=[   92],
     | 30.00th=[  102], 40.00th=[  117], 50.00th=[  133], 60.00th=[  143],
     | 70.00th=[  151], 80.00th=[  157], 90.00th=[  165], 95.00th=[  172],
     | 99.00th=[  265], 99.50th=[  359], 99.90th=[  486], 99.95th=[  490],
     | 99.99th=[  490]
    bw (KB  /s): min=   52, max=  577, per=65.78%, avg=312.46, stdev=94.94
    lat (usec) : 50=0.01%
    lat (msec) : 10=0.01%, 20=0.02%, 50=0.05%, 100=27.95%, 250=70.98%
    lat (msec) : 500=0.99%
  cpu          : usr=0.82%, sys=1.48%, ctx=21539, majf=0, minf=22
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.8%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=7215/w=7131/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-fuse-erasure_1: (groupid=1, jobs=1): err= 0: pid=11022: Thu Mar  1 17:08:09 2018
  read : io=15464KB, bw=262740B/s, iops=64, runt= 60269msec
    slat (msec): min=1, max=429, avg= 5.20, stdev= 8.95
    clat (msec): min=103, max=1218, avg=244.60, stdev=123.00
     lat (msec): min=105, max=1229, avg=249.80, stdev=123.40
    clat percentiles (msec):
     |  1.00th=[  143],  5.00th=[  157], 10.00th=[  167], 20.00th=[  180],
     | 30.00th=[  190], 40.00th=[  198], 50.00th=[  206], 60.00th=[  217],
     | 70.00th=[  235], 80.00th=[  258], 90.00th=[  363], 95.00th=[  545],
     | 99.00th=[  685], 99.50th=[  717], 99.90th=[ 1106], 99.95th=[ 1221],
     | 99.99th=[ 1221]
    bw (KB  /s): min=   26, max=  442, per=87.49%, avg=223.97, stdev=86.34
  write: io=14788KB, bw=251255B/s, iops=61, runt= 60269msec
    slat (msec): min=4, max=902, avg=10.82, stdev=28.00
    clat (usec): min=19, max=1229.8K, avg=248568.76, stdev=123257.45
     lat (msec): min=110, max=1249, avg=259.39, stdev=126.51
    clat percentiles (msec):
     |  1.00th=[  145],  5.00th=[  163], 10.00th=[  172], 20.00th=[  184],
     | 30.00th=[  194], 40.00th=[  202], 50.00th=[  212], 60.00th=[  223],
     | 70.00th=[  239], 80.00th=[  260], 90.00th=[  355], 95.00th=[  545],
     | 99.00th=[  693], 99.50th=[  750], 99.90th=[ 1074], 99.95th=[ 1106],
     | 99.99th=[ 1237]
    bw (KB  /s): min=   12, max=  380, per=87.76%, avg=215.01, stdev=76.47
    lat (usec) : 20=0.01%
    lat (msec) : 250=77.22%, 500=15.64%, 750=6.72%, 1000=0.19%, 2000=0.22%
  cpu          : usr=0.42%, sys=0.83%, ctx=11303, majf=0, minf=21
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.2%, 32=99.6%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=3866/w=3697/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-replicated: (groupid=2, jobs=1): err= 0: pid=11592: Thu Mar  1 17:08:09 2018
  read : io=37216KB, bw=633695B/s, iops=154, runt= 60138msec
    slat (usec): min=17, max=4148, avg=139.58, stdev=90.76
    clat (usec): min=445, max=479849, avg=102381.28, stdev=66092.10
     lat (usec): min=542, max=479946, avg=102522.48, stdev=66107.50
    clat percentiles (usec):
     |  1.00th=[ 1112],  5.00th=[10944], 10.00th=[14016], 20.00th=[17280],
     | 30.00th=[41728], 40.00th=[108032], 50.00th=[121344], 60.00th=[134144],
     | 70.00th=[142336], 80.00th=[152576], 90.00th=[168960], 95.00th=[181248],
     | 99.00th=[242688], 99.50th=[337920], 99.90th=[448512], 99.95th=[456704],
     | 99.99th=[481280]
    bw (KB  /s): min=   26, max= 2129, per=56.86%, avg=351.40, stdev=315.77
  write: io=37524KB, bw=638940B/s, iops=155, runt= 60138msec
    slat (usec): min=17, max=95806, avg=191.58, stdev=994.39
    clat (msec): min=1, max=471, avg=102.92, stdev=65.47
     lat (msec): min=2, max=472, avg=103.12, stdev=65.48
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[   13], 10.00th=[   15], 20.00th=[   19],
     | 30.00th=[   50], 40.00th=[  110], 50.00th=[  121], 60.00th=[  135],
     | 70.00th=[  143], 80.00th=[  153], 90.00th=[  169], 95.00th=[  182],
     | 99.00th=[  241], 99.50th=[  338], 99.90th=[  441], 99.95th=[  449],
     | 99.99th=[  474]
    bw (KB  /s): min=   26, max= 2168, per=56.83%, avg=354.08, stdev=320.16
    lat (usec) : 500=0.01%, 750=0.14%, 1000=0.25%
    lat (msec) : 2=0.51%, 4=1.61%, 10=1.55%, 20=20.22%, 50=6.00%
    lat (msec) : 100=6.26%, 250=62.52%, 500=0.94%
  cpu          : usr=0.65%, sys=2.50%, ctx=27922, majf=0, minf=20
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.8%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=9304/w=9381/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-erasure_1: (groupid=3, jobs=1): err= 0: pid=12190: Thu Mar  1 17:08:09 2018
  read : io=22332KB, bw=380334B/s, iops=92, runt= 60126msec
    slat (usec): min=27, max=2224, avg=159.84, stdev=76.91
    clat (msec): min=1, max=1165, avg=168.65, stdev=116.64
     lat (msec): min=1, max=1165, avg=168.81, stdev=116.64
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[   95], 10.00th=[  108], 20.00th=[  120],
     | 30.00th=[  127], 40.00th=[  135], 50.00th=[  143], 60.00th=[  151],
     | 70.00th=[  161], 80.00th=[  178], 90.00th=[  219], 95.00th=[  408],
     | 99.00th=[  701], 99.50th=[  717], 99.90th=[ 1156], 99.95th=[ 1156],
     | 99.99th=[ 1172]
    bw (KB  /s): min=   16, max= 1184, per=100.00%, avg=387.32, stdev=161.71
  write: io=22372KB, bw=381015B/s, iops=93, runt= 60126msec
    slat (usec): min=28, max=70624, avg=219.17, stdev=946.16
    clat (msec): min=10, max=1165, avg=174.84, stdev=116.83
     lat (msec): min=10, max=1165, avg=175.06, stdev=116.82
    clat percentiles (msec):
     |  1.00th=[   54],  5.00th=[  103], 10.00th=[  113], 20.00th=[  123],
     | 30.00th=[  129], 40.00th=[  137], 50.00th=[  145], 60.00th=[  155],
     | 70.00th=[  165], 80.00th=[  184], 90.00th=[  229], 95.00th=[  424],
     | 99.00th=[  693], 99.50th=[  725], 99.90th=[ 1156], 99.95th=[ 1172],
     | 99.99th=[ 1172]
    bw (KB  /s): min=   16, max=  832, per=100.00%, avg=382.89, stdev=156.30
    lat (msec) : 2=0.20%, 4=0.38%, 10=0.19%, 20=0.30%, 50=0.71%
    lat (msec) : 100=3.28%, 250=86.69%, 500=4.13%, 750=3.75%, 1000=0.17%
    lat (msec) : 2000=0.21%
  cpu          : usr=0.46%, sys=1.82%, ctx=18758, majf=0, minf=20
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.7%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=5583/w=5593/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: io=28860KB, aggrb=480KB/s, minb=480KB/s, maxb=480KB/s, mint=60003msec, maxt=60003msec
  WRITE: io=28524KB, aggrb=475KB/s, minb=475KB/s, maxb=475KB/s, mint=60003msec, maxt=60003msec

Run status group 1 (all jobs):
   READ: io=15464KB, aggrb=256KB/s, minb=256KB/s, maxb=256KB/s, mint=60269msec, maxt=60269msec
  WRITE: io=14788KB, aggrb=245KB/s, minb=245KB/s, maxb=245KB/s, mint=60269msec, maxt=60269msec

Run status group 2 (all jobs):
   READ: io=37216KB, aggrb=618KB/s, minb=618KB/s, maxb=618KB/s, mint=60138msec, maxt=60138msec
  WRITE: io=37524KB, aggrb=623KB/s, minb=623KB/s, maxb=623KB/s, mint=60138msec, maxt=60138msec

Run status group 3 (all jobs):
   READ: io=22332KB, aggrb=371KB/s, minb=371KB/s, maxb=371KB/s, mint=60126msec, maxt=60126msec
  WRITE: io=22372KB, aggrb=372KB/s, minb=372KB/s, maxb=372KB/s, mint=60126msec, maxt=60126msec